# Zone Calculated Heating Load Property

Source: https://www.revitapidocs.com/2026/dbf07896-7e8b-5f87-2473-4b75f2154f14.htm

---

| Zone Calculated Heating Load Property |
| --- |

**Note: This API is now obsolete.**

Get the Calculated Heating Load of the Zone.
**Namespace:** Autodesk.Revit.DB.Mechanical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
[ObsoleteAttribute("This property is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone and SystemZoneData objects instead.")]
public double CalculatedHeatingLoad { get; }
```

```
<ObsoleteAttribute("This property is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone and SystemZoneData objects instead.")>
Public ReadOnly Property CalculatedHeatingLoad As Double
	Get
```

```
public:
[ObsoleteAttribute(L"This property is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone and SystemZoneData objects instead.")]
property double CalculatedHeatingLoad {
	double get ();
}
```

```
[<ObsoleteAttribute("This property is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone and SystemZoneData objects instead.")>]
member CalculatedHeatingLoad : float with get
```

#### Property Value

Double Remarks This property is used to get the Calculated Heating Load of the Zone. See Also

#### Reference

Zone Class Autodesk.Revit.DB.Mechanical Namespace